app/views/shared/_primary_nav.html.haml

SELECT `city101s`.* FROM `city101s` WHERE `city101s`.`city_id` = 1 LIMIT 1
---

    - if !@city.blank? and !@city.city101.blank?