app/views/events/_description_list.html.erb

<!-- Where -->
<% if !@event.venue.blank? %>
---
SELECT `venues`.* FROM `venues` WHERE `venues`.`id` = 1 LIMIT 1