app/controllers/categories_controller.rb

  def index
    @city = City.find( params[:city_id] )
    @category = Category.all
---
SELECT `categories`.* FROM `categories`

  def show
    @city = City.find( params[:city_id] )
    @category = Category.find(params[:id])
    @category_events = @category.self_and_descendants.collect{ |x| x.events.upcoming.approved.where(:city_id => @city.id) }.flatten.uniq.sort_by {|s| s.start_time}
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
SELECT `events`.* FROM `events` INNER JOIN `categories_events` ON `events`.`id` = `categories_events`.`event_id` WHERE `categories_events`.`category_id` = 1 AND `events`.`approved` = 1 AND `events`.`city_id` = 1 AND (TIME_TO_SEC(TIMEDIFF(`start_time`,'2014-01-18 20:24:56')) >= 0 OR (start_time < '2014-01-18 20:24:56' AND end_time >= '2014-01-18 20:24:56' AND end_time IS NOT NULL)) ORDER BY `start_time` ASC