app/controllers/cities_controller.rb

  def show
    @city = City.find(params[:city_id])
    @categories = Category.roots[0..7]
    @slides = @city.frontpage_sliders.order('weight DESC').where('CURDATE() BETWEEN start_date AND end_date')
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 0 LIMIT 1
SELECT COUNT(*) FROM `frontpage_sliders` WHERE `frontpage_sliders`.`city_id` = 1 AND (CURDATE() BETWEEN start_date AND end_date)