app/controllers/events_controller.rb

SELECT `events`.* FROM `events` WHERE `events`.`city_id` = 1 AND `events`.`approved` = 1 AND (TIME_TO_SEC(TIMEDIFF(`start_time`,'2014-01-18 20:15:14')) >= 0 OR (start_time < '2014-01-18 20:15:14' AND end_time >= '2014-01-18 20:15:14' AND end_time IS NOT NULL)) AND (`start_time` <= '2014-01-25') ORDER BY `start_time` ASC
---
  def index
    @city = City.find( params[:city_id] )

    if params.has_key?('start_at')
      d = params[:start_at].to_date
      @started_at = d
      @events = @current_city.events.in_range(d, (d + 6)).approved
      wk_start = @started_at.to_datetime
      wk_end = wk_start + 7
      add_breadcrumb wk_start.strftime("%b %e") + " - " + wk_end.strftime("%b %e") , ""
    else
      @started_at = Date.current
      @events = @city.events.upcoming.approved.where("`start_time` <= ?", (@started_at + 7).to_s(:db) )

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
---
  def show
    @city = City.find(params[:city_id])

SELECT `venues`.* FROM `venues`
SELECT `labels`.* FROM `labels`
SELECT `categories`.* FROM `categories`
---
  def new
    @city = City.find(params[:city_id])
    @event = Event.new
    @event.city = @city

    @venues = Venue.all
    @venue = Venue.new
    @venue.city = @city
    @labels = Label.all
    @categories = Category.all

INSERT INTO `events` (`all_day`, `approved`, `buy_tickets`, `city_id`, `created_at`, `description`, `end_time`, `event_contact`, `event_host`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `name`, `price`, `slug`, `start_time`, `updated_at`, `user_id`, `venue_id`, `website`) VALUES (1, 1, NULL, 1, '2014-01-18 09:53:34', 'ADSAD', '2014-01-30 09:30:00', 'SDASS', 'ASDASD', NULL, NULL, NULL, NULL, 'asADSAS', 'SDAS', 'asadsas', '2014-01-21 06:30:00', '2014-01-18 09:53:34', NULL, 1, 'https://www.SADKASDJ.COM')
INSERT INTO `venues` (`city_id`, `city_name`, `created_at`, `description`, `facebook`, `foursquare`, `friday`, `holidays`, `hours_override`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `is_venue`, `monday`, `name`, `phone`, `phone_alt`, `saturday`, `slug`, `staff_address`, `staff_email`, `staff_name`, `staff_phone`, `state`, `street_address`, `sundays`, `thursday`, `tuesday`, `twitter`, `updated_at`, `user_id`, `website`, `wednesday`, `yelp`, `zip`) VALUES (1, 'SADA', '2014-01-18 09:53:34', 'Venue for asADSAS Event', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'sadAS', NULL, NULL, NULL, 'sadas', NULL, NULL, NULL, NULL, 'as', 'ASDAS', NULL, NULL, NULL, NULL, '2014-01-18 09:53:34', NULL, NULL, NULL, NULL, 'sada')
---
  def create
    @user = current_user
    @city = City.find(params[:city_id])
    @event = Event.new(params[:event])
    @event.city = @city
    @event.user = @user


    # Determine New/Existing Venue, add attributes for validation
    if @event.venue_id.blank?
      @venue = Venue.new(params[:event][:venue_attributes])
      @venue.description = "Venue for " + @event.name + " Event"
      @venue.city = @city
      if @venue.save

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
---
  def success
    @city = City.find(params[:city_id])

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
SELECT `events`.* FROM `events` WHERE `events`.`city_id` = 1 AND ((start_time >= '2014-01-01 00:00:00' AND start_time < '2014-02-01 23:59:59' ) OR (end_time >= '2014-01-01 00:00:00' AND end_time < '2014-02-01 23:59:59'))
---
  def events_per_day
    city = City.find(params[:city_id])
    @events = city.events.month(params[:year], params[:month])
    days = {}
    (1..31).each do |d|
      days[d] = 0
    end

    @events.each do |e|