app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:page_id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 0 LIMIT 1

  def contact_us
    @page = Page.where(:title => "Contact Us").first
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`title` = 'Contact Us' LIMIT 1